 #+FILETAGS: :SEAS:

#+BEGIN: clocktable :scope file :maxlevel 2 :block thisweek
#+CAPTION: Clock summary at [2024-07-31 Wed 12:30], for week 2024-W31.
| Headline                             | Time |      |
|--------------------------------------+------+------|
| *Total time*                           | *3:05* |      |
|--------------------------------------+------+------|
| Meetings                             | 3:05 |      |
| \_  re: Nami - June 2025 Event       |      | 0:45 |
| \_  re Associations 2030             |      | 0:22 |
| \_  re:Sales                         |      | 0:54 |
| \_  re World Chemical Forum (WCF)... |      | 1:04 |
#+END:

#+BEGIN: clocktable :scope file :maxlevel 2 :block lastmonth
#+CAPTION: Clock summary at [2024-07-31 Wed 12:30], for June 2024.
| Headline                          | Time |      |
|-----------------------------------+------+------|
| *Total time*                        | *7:45* |      |
|-----------------------------------+------+------|
| Meetings                          | 7:45 |      |
| \_  re: Summer Camp               |      | 2:35 |
| \_  re Dow Jones Opus             |      | 0:46 |
| \_  re: Weekly Marketing Meeting  |      | 1:26 |
| \_  re DOW JONES Security         |      | 0:41 |
| \_  team re website               |      | 1:38 |
| \_  with Monthly Managers Meeting |      | 0:39 |
#+END:

* Notes
:PROPERTIES:
:CATEGORY: Note
:END:

** IT Related Notes :NOTE:

*** Prodstor
- Address: [[http://10.0.0.87/Main]]
- Pass: prodlabs version no year
*** Bitlys

- Our Studio Page (Email Banner) - https://bit.ly/33Qq9bx

*** Passkey
*** ufi -

- Timmymayes
- Prod labs one with emphesis!
- @9Efh6ni49asdf
*** Static IP

- seas.areyouonlinerightnow.com
  
*** Stripe Saved Key

[2023-02-03 Fri]

ukcb-onfh-ywmz-essy-xhyk

*** Hubspot Codes
| TUMN3 | PIHNG |
| EZNWA | YVYHE |
| H7HBJ | OHH4X |
| KYDH4 | MXPIJ |
| CURKS | QUSN7 |
| 4R5OF | QGJVN |
| FRGDA | IQMVZ |
| 5QY3A | O2TQJ |
| W5WPZ | HOTOT |
| XM6VG | 2JOZR |

*** Lasso - Zapier
Update to lasso app
- Update Event
  - Start Date
  - End Date
  - Status
- Event ID - we could use the record ID from hubspot
  - Must search for record id using Lasso Find Event in lasso
  - FIND Event Account Status

*** Priya pass
- 4eYG8mqZCLVK6dZ<

** Website Related Notes :NOTE:
*** Divi Video Embed for Website

[[https://www.jucra.com/whmcs/knowledgebase/77/How-to-correctly-embed-a-Vimeo-video-in-the-divi-video-module.html][Vimeo Embed]]

** Black Magic Camera Settings :NOTE:
*** Record
**** Codec & Quality

- Braw
- Constant Bitrate
- 8:1
- Ultra HD

**** Dynamic Range

- Film
- 29.97
- SD Card

*** Monitor
**** LCD

- only Frame Guide and grid on
- Page two status text on and display meteres

**** HDMI

- Clean Feed 

**** Both

- Frame Guides: 2.4:1
- Guide Opacity: 50%
- Focus Assist: Colored Lines
- Focus assit level: Medium
- Focus Color Red
- Zebra levels 95%

*** Audio
*** Setup

Shutter Angle & 60hz

*** Presets
*** Luts
** Podcast Info/Notes :NOTE:
*** Text Settings for podcast clilps

- max characters - 14
- min dur in sec 3
- single line
- Montseratt black
- bottom center -386
- white fill / black stroke (outer) (10px)
- caps+bold
- 85
- shadow off

*** Podcast Page build out
**** Lasso page design references

- [[https://podcast.lasso.io/corralling-the-chaos-podcast/all][Feed Page]]
- [[refe][Episode page]]

**** Embedable player

https://transistor.fm/pricing/

** UFO 1x rafters above Richards desk

- https://store.ui.com/us/en/pro/category/all-wifi/products/u6-iw

*** When we move this possibly relocate the repeater outside  by docks
** Wifi connection points :NOTE:



[2023-09-25 Mon]

*** 3x Wall plates
**** Josh's office
**** Pm Room
**** Podcast room
*** Mount intenal front warehouse ufo in rafters
*** For studio consider the following:

- https://store.ui.com/us/en/pro/category/all-wifi/products/u6-enterprise

** Mitch Training video :NOTE:

[[https://drive.google.com/drive/u/1/folders/0B98uBS-sK4xufk9IVThxX1dPX1pCZ3BGVEhGZE92QnNpTmtyRzBGLUFFZk94c1gzRnkyaGc?resourcekey=0-wbKVIoEunyi_p6ZXZLRNsQ][link]]

* Tasks
:PROPERTIES:
:CATEGORY: Task
:END:

** Archive :ARCHIVE:
** TODO Create Lead Magnets for Site                               :CONTENT:
:PROPERTIES:
:CATEGORY: Project
:END:
:LOGBOOK:
- State "NEXT"       from "HOLD"       [2024-04-25 Thu 11:24]
- State "HOLD"       from "TODO"       [2023-09-06 Wed 14:38] \\
  Not working on this till the new year
:END:

 [2023-01-23 Mon 16:09]

*** TODO AV Meeting Guide - What to bring to your first Meeting
:PROPERTIES:
:CATEGORY: Task
:END:

[2023-01-23 Mon 16:19]

**** Starting point

- Target Budget
- Schedule - not detailed just start end times when applicabal
    - Load in
    - Rehersals
    - Show days (start / end is important here)
    - Loadout
- Location / venue
    - Tables & potential stage size
    - DIagram with measurments & Rig points
- Audience Size
- **************************************Basic Scope of work**************************************
- Nice to haves
    - Power & Internet needs
    - Venue contacts if this is locked in
    - Load in / out plans
        - Docks vs not docks
        - Distance to show site and wat the route looks like - this will affect how long to move gear and how many hands are needed
    - Photos / Ideas like a mood board or examples from previous years

*** TODO SD Venue Guide
:PROPERTIES:
:CATEGORY: Project
:END:
:LOGBOOK:
- State "NEXT"       from "HOLD"       [2024-04-25 Thu 11:28]
- State "HOLD"       from "TODO"       [2023-09-06 Wed 13:49] \\
  Waiting on this until we're at the new year
:END:

 [2023-08-06 Sun 20:10]

**** TODO Get list of top 10 venues in SD from sales team
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "TODO"       from "HOLD"       [2023-09-06 Wed 13:52]
- State "HOLD"       from "WAITING"    [2023-09-06 Wed 13:52] \\
  Waiting until we reboot this project
- State "WAITING"    from "TODO"       [2023-01-23 Mon 16:10] \\
  [2023-01-23 Mon] Email sent
:END:
 [2023-01-23 Mon 16:10]

**** NEXT Revaluate the status of the venue guide
:PROPERTIES:
:CATEGORY: Task
:END:

 [2023-09-06 Wed 13:51]

*** TODO Create Site Visit Checklist
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-10-09 Wed 12:40]

*** TODO Create Lead Magnet from show flow
:PROPERTIES:
:CATEGORY: Task
:END:
[[https://docs.google.com/document/d/1JgjtK_XYtk49Av6gObVkMoFNVBRsOdUyIV0LdOVrGoM/edit]]
** TODO Hubspot final setup                                     :OPERATIONS:
:PROPERTIES:
:CATEGORY: Project
:END:

 [2023-05-05 Fri 12:56]

*** DONE Finish Segmenting Contacts / Companies
CLOSED: [2023-06-26 Mon 17:29]

 [2023-05-05 Fri 12:57]

*** CANCELLED Create form for call center to submit directly into hubspot :CANCELLED:
CLOSED: [2023-06-26 Mon 17:28]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2023-06-26 Mon 17:28] \\
  No longer need this
:END:
 [2023-05-05 Fri 12:57]

*** CANCELLED Create Report: Clients vs customers :CANCELLED:
CLOSED: [2023-11-07 Tue 13:40]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "CANCELLED"  from "HOLD"       [2023-11-07 Tue 13:40] \\
  Not doing this
- State "HOLD"       from "NEXT"       [2023-07-31 Mon 11:36] \\
  Not sure that this is needed anymore
:END:
 [2023-05-05 Fri 12:58]

 Client refers us lots of business
 Customer is a job at a time and we want to convert them.
 Can we build a report based on contacts for this?

*** DONE Brainstorm hygiene automations (list inside)
CLOSED: [2023-11-07 Tue 13:37]
:PROPERTIES:
:CATEGORY: Task
:END:

 [2023-05-05 Fri 12:59]
- Remove contacts after lack of engagement
  - Must have ignored us X times
- Change lead cycle stage based on number of deals in time frame

*** DONE Confirm if we need anymore hubspot reports fow now (list inside)
CLOSED: [2023-06-26 Mon 17:28]
:LOGBOOK:
- State "DONE"       from "CANCELLED"  [2023-06-26 Mon 17:28]
:END:
 [2023-05-05 Fri 13:00]

 REPORTS
Each person's dashboard should show:
Sales vs quota per person
monthly
quarterly
yearly
Sales vs goal per person
monthly
quarterly
yearly
% existing biz vs. new biz (Pie chart)
$$ total new vs existing
% events vs. rentals vs. sales (pie chart)
$$ total new vs existing
lost deals by new vs. existing clients
won deals by new vs. existing clients
Sales until next commission tier? (Nice To Have)

USEFUL AUTOMATIONS
contact opportunities
can HubSpot automatically generate this based on potential? previous sales and not enough contact?

OTHER
how do we make sure the final invoice amount is recorded in HubSpot if we are using this for tracking?
new property to record final invoice?
new stage to record what has been invoiced?

*** CANCELLED Create automated process to pop opportunities into the pipeline :CANCELLED:
CLOSED: [2023-06-26 Mon 17:27]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2023-06-26 Mon 17:27] \\
  No longer doing this
:END:
 [2023-05-05 Fri 13:02]

 utilize the /recurring event/ property to populate X months ahead.

*** DONE Create & Manage Workflows
CLOSED: [2023-10-01 Sun 23:57]

 [2023-05-17 Wed 14:26]

**** DONE Remove do not contact from marketing contact
CLOSED: [2023-06-10 Sat 15:23] SCHEDULED: <2023-05-17 Wed 15:15>
:PROPERTIES:
:Effort:   0:10
:END:

 [2023-05-17 Wed 14:26]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

**** DONE Make worflow for setting all new contacts as marketing contacts
CLOSED: [2023-05-17 Wed 14:56] SCHEDULED: <2023-05-17 Wed 15:00>
:PROPERTIES:
:Effort:   0:10
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 14:52]--[2023-05-17 Wed 14:56] =>  0:04
:END:
 [2023-05-17 Wed 14:27]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

**** DONE Figure out workflow for Cold Lead + George Owns + No Response
CLOSED: [2023-06-11 Sun 15:45]

 [2023-05-17 Wed 14:28]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

**** DONE Run through existing workflows and rename / organise
CLOSED: [2023-09-18 Mon 12:10] SCHEDULED: <2023-09-08 Fri>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-09-18 Mon 11:14]--[2023-09-18 Mon 12:10] =>  0:56
CLOCK: [2023-08-07 Mon 14:38]--[2023-08-07 Mon 15:55] =>  1:17
:END:

 [2023-06-27 Tue 09:47]

*** DONE Clean Contact Type property and make it required
CLOSED: [2023-06-27 Tue 09:36] SCHEDULED: <2023-06-19 Mon 08:00>

 [2023-05-17 Wed 14:29]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

*** DONE Update sales guys on the use of /Other/ as a contact type
CLOSED: [2023-06-27 Tue 09:36] SCHEDULED: <2023-06-19 Mon>

 [2023-05-17 Wed 14:29]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

*** DONE Clean up George's bulk imports
CLOSED: [2023-06-10 Sat 15:23] SCHEDULED: <2023-05-17 Wed>

 [2023-05-17 Wed 14:30]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

*** DONE Create our list for this event (cold leads & non cold leads)
CLOSED: [2023-06-10 Sat 15:23] SCHEDULED: <2023-05-17 Wed>

 [2023-05-17 Wed 14:30]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

*** DONE Figure out how / if we can update the *about* section for hubspot gmail plugin
CLOSED: [2023-06-10 Sat 15:23] SCHEDULED: <2023-05-18 Thu>

 [2023-05-17 Wed 14:36]
 [[file:~/Orgfiles/SEAS.org::*with Julie & Zack RE Phil Mershon Speaking Gig][with Julie & Zack RE Phil Mershon Speaking Gig]]

*** CANCELLED Create a hubspot refresher video for people to hit contacts we haven't talked to in a while. :CANCELLED:
CLOSED: [2023-11-07 Tue 13:37]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2023-11-07 Tue 13:37] \\
  Not doing this
:END:

[2023-06-19 Mon]

*** NEXT Redo hubspot follow up survey as hubspot sequence
:PROPERTIES:
:CATEGORY: Task
:END:

:PROPERTIES:
:CATEGORY: Task
:END:
 [2023-08-14 Mon 08:38]

** NEXT Podcast Editing                                            :CONTENT:
:PROPERTIES:
:CATEGORY: Project
:END:

 [2023-09-06 Wed 13:59]

 Ongoing task for editing all podcasts

*** DONE Edit Zack and Troy podcasts
CLOSED: [2024-04-25 Thu 11:31]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-15 Mon 10:22]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** DONE Edit LGBT Podcast
CLOSED: [2024-07-11 Thu 12:34]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-15 Mon 10:22]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** CANCELLED Edit Stephen Dela Cruz Podcast                    :CANCELLED:
CLOSED: [2024-05-02 Thu 15:48] SCHEDULED: <2024-04-30 Tue 13:00>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOqOK:
CLOCK: [2024-04-30 Tue 12:48]--[2024-04-30 Tue 15:50] =>  3:02
:END:
 [2024-04-30 Tue 12:44]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** TODO Edit Blooper Podcast
SCHEDULED: <2024-12-16 Mon>
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-07-09 Tue 15:17]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** DONE Edit Highlights Podcast
CLOSED: [2024-08-22 Thu 10:14]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-07-09 Tue 15:18]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** DONE Edit Josh Podcast
CLOSED: [2024-08-22 Thu 10:14]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-07-09 Tue 15:19]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** DONE Edit Labor Podcats
CLOSED: [2024-08-22 Thu 10:14]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-07-09 Tue 15:19]
 [[file:~/Orgfiles/configbackups/main-config.org::*Bindings][Bindings]]

*** DONE Finalize Kids Podcast
CLOSED: [2024-10-07 Mon 12:18]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-09-19 Thu 12:10]
 [[file:~/Orgfiles/SEAS.org::*Podcast Editing][Podcast Editing]]

*** DONE Edit Halloween Podcast
CLOSED: [2024-11-06 Wed 14:44] SCHEDULED: <2024-10-30 Wed 10:30>
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-10-29 Tue 13:39]

** TODO Awards Option
:PROPERTIES:
:CATEGORY: Task
:END:

 [2023-10-03 Tue 13:24]
 
- The Telly award  - [[https://www.tellyawards.com][Link]]
- Resreach some additional ones
- Avixxa
- 

** NEXT Podcast Recordings                                         :CONTENT:
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-01-30 Tue 09:28]

*** WAITING Record Troy & Zack                                    :WAITING:
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "WAITING"    from "NEXT"       [2024-10-29 Tue 12:55] \\
  Need to figure out when this should happen.
CLOCK: [2024-10-15 Tue 13:17]--[2024-10-15 Tue 14:37] =>  1:20
:END:
 [2024-10-09 Wed 12:25]
*** NEXT Record Jay Sheehan podcast
SCHEDULED: <2024-12-11 Wed 11:00>
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-11-26 Tue 13:36]

** TODO Setup WSL on work pc so emacs is fast again
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:25]

** NEXT File Server Rebuild                                             :IT:
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-04-25 Thu 11:32]

*** TODO Download & Convert all SMMW Drives
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:33]

  - [X] Drive 1
  - [ ] Drive 2
  - [ ] Drive 3
  - [ ] Drive 4
  - [ ] Drive 5

*** TODO Transfer all Leap Drives direct to server
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:34]

*** DONE Clean up desktop F Drive
CLOSED: [2024-09-03 Tue 15:14]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:34]

*** NEXT Re-instate Zipped files from Unraid server
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-04-25 Thu 11:34]

**** DONE Build a todo list for zipped folders
CLOSED: [2024-04-25 Thu 12:04]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-04-25 Thu 11:45]--[2024-04-25 Thu 12:04] =>  0:19
:END:
 [2024-04-25 Thu 11:35]


**** TODO Move all 2021-2023 Files
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:45]

 - [X] Jan 21
 - [X] Jun 21
 - [X] Jan 22
 - [X] Apr 22
 - [X] Jun 22
 - [X] Jul 22
 - [X] Aug 22
 - [X] Sep 22
 - [X] Oct 22
 - [X] Nov 22
 - [X] Dec 22
 - [X] Jan 23
 - [ ] Feb 23
 - [ ] Mar 23
   


 

**** TODO Move Leap
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:45]

**** TODO Filter through then transfer Marketing
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:46]

**** DONE Filter through then move Needs to be filed
CLOSED: [2024-05-06 Mon 11:17]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:46]

**** DONE Filter through and move Quickdrop
CLOSED: [2024-05-06 Mon 11:17]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:46]

**** DONE Confirm if we need to keep zoom recording backups
CLOSED: [2024-05-17 Fri 10:32]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-04-25 Thu 11:46]

**** TODO Unpack and move all zip files in the Ingest folder
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-04-25 Thu 11:47]
 
***** NEXT 03 - March
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO  Unzip 07 - July
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip 09 - Sep
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  10 - Oct
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  11 - Nov
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  12 - Dec
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Podcast
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Podcasts
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Powur
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Scratch Media
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  SMMW23
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Unsorted
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Video Projects
:PROPERTIES:
:CATEGORY: Task
:END:
[2024-04-25 Thu]
***** TODO Unzip  Endologix
:PROPERTIES:
:CATEGORY: Task
:END:
** Meetings Notes                                                     :NOTE:
- 
** NEXT Associations Values Campaign
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-08-22 Thu 10:22]

*** DONE Get Troy the printed flyers
CLOSED: [2024-09-03 Tue 13:40] DEADLINE: <2024-08-23 Fri>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "DONE"       from "WAITING"    [2024-09-03 Tue 13:40]
- State "WAITING"    from "NEXT"       [2024-08-22 Thu 10:23] \\
  Waiting on drives to arrive
:END:
 [2024-08-22 Thu 10:22]

*** NEXT Update Flyer with bigger print
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-09-19 Thu 12:10]
 [[file:~/Orgfiles/SEAS.org::*Associations Values Campaign][Associations Values Campaign]]

** NEXT SEAS Blog
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-10-09 Wed 12:28]
**** DONE Post and Schedule Blog for 11/13
CLOSED: [2024-11-26 Tue 13:22]
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "DONE"       from "WAITING"    [2024-11-26 Tue 13:22]
- State "WAITING"    from "TODO"       [2024-10-29 Tue 13:42] \\
  Need blog from Zack
:END:
 [2024-10-29 Tue 13:41]

**** WAITING Edit and schedule blog for 11/27                    :WAITING:
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2024-10-29 Tue 13:42] \\
  Waiting on blog from Zack
:END:
 [2024-10-29 Tue 13:42]


** DONE Onboard Jeremy
CLOSED: [2024-11-26 Tue 13:31]
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-10-09 Wed 12:34]

*** DONE Create Jeremy's Business Cards
CLOSED: [2024-10-23 Wed 12:34] SCHEDULED: <2024-10-10 Thu>
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-10-09 Wed 12:35]

*** DONE Create Signature for Jeremy
CLOSED: [2024-11-26 Tue 13:26]
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-10-09 Wed 12:39]


** NEXT Clear inbox
SCHEDULED: <2024-12-10 Tue 16:30 +1w>
:PROPERTIES:
:LAST_REPEAT: [2024-10-30 Wed 16:15]
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2024-10-30 Wed 16:15]
:END:
 [2024-10-09 Wed 12:38]
:PROPERTIES:
:CATEGORY: Task
:END:


** NEXT GSuite Admin
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-10-09 Wed 12:48]

*** NEXT Onboard LEO
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-11-26 Tue 13:11]


** NEXT SEAS Website
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-10-09 Wed 12:52]

*** NEXT Create Indvidual Podcast Pages
:PROPERTIES:
:CATEGORY: Project
:END:
 [2024-11-26 Tue 13:18]

**** NEXT Transcribe all podcasts to text
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-11-26 Tue 13:25]--[2024-12-05 Thu 18:43] => 221:18
:END:
 [2024-11-26 Tue 13:21]

**** TODO Convert transcipts to individual document layouts
SCHEDULED: <2024-12-10 Tue 14:30>
:PROPERTIES:
:CATEGORY: Task
:Effort:   3:00
:END:
 [2024-11-26 Tue 13:37]

** DONE Register Julies Laptop with Auorus
CLOSED: [2024-11-21 Thu 13:52] SCHEDULED: <2024-10-30 Wed 10:00>
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-10-29 Tue 13:48]


** NEXT Build a case study from Cutwater
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-11-26 Tue 13:26]


*** NEXT Research Case Studies to see what is needed
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-11-26 Tue 13:34]
 [[file:~/Orgfiles/SEAS.org::*Build a case study from Cutwater][Build a case study from Cutwater]]

*** TODO Schedule a podcast via Josh with Cutwater Team
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-11-26 Tue 13:35]
 [[file:~/Orgfiles/SEAS.org::*Build a case study from Cutwater][Build a case study from Cutwater]]

** NEXT Pull together Marketing Reporting for End of Year Report
SCHEDULED: <2024-12-10 Tue>
:PROPERTIES:
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2024-12-09 Mon 11:43]--[2024-12-09 Mon 15:19] =>  3:36
:END:
 [2024-11-26 Tue 13:40]

 - [ ] Podcast
 - [ ] Social
 - [ ] Blogs
 - [ ] Emails
 - [ ] Bi-Yearly Events
 - [ ] Quarterly Taco Tuesdays
** TODO Look into ShelfClutter for B&B
:PROPERTIES:
:CATEGORY: Task
:END:
 [2024-12-09 Mon 12:10]


 - https://docs.google.com/forms/d/e/1FAIpQLSeqrmVfaWfUFQH6HgYsinebsIyRNy2RAXMGV4UFFt0czn57lw/viewform?pli=1
* Reminders
:PROPERTIES:
:CATEGORY: Reminder
:END:

** SMMW24 Raw Recording Meeting                                   :REMINDER:
:PROPERTIES:
:CATEGORY: Meeting
:END:
 <2024-04-16 Tue 13:00> 
 [2024-04-16 Tue 10:53]

*** Recordings List

**** Drive 1 - Cam 2
- Session 1 Preshow - Ann Handley
- Session 1 -  Ann Handley
- Session 2 - Jim Lauderback
- Session 3 - Mari Smith
- Session 4 Brooke Sellas
- Session 5 Raul Roetzer pt 1
- Session 5 Raul Roetzer pt 2

**** Drive 2 - Cam 1
- Session 1 Pre-show Ann Handley
- Session 2 Jim Lauderback
- Session 3 Mari Smith
- Session 4 Brook Sellers
- Session 4 Brooke Sellers pt 2
- Session 5 Paul Roetzer

**** Drive 3 - Cam 3
- Session 1 Preshow - Ann Handley
- Session 1 - Ann Handley
- Session 2 - Jim Lauderback
- Session 3 - Mari Smith
- Session 4 - Brooke Sellas
- Session 5 - Paul Roetzer pt1
- Session 5 - Raul Roetzer pt2

**** Drive 4
- Capture0002
- Session 1 - Todd Michael Stelzner
- Session 2 - Michael Stelzner
- Session 3 - Mindy Weinstein
- Session 4 - Joe Pullizi
- Session 5 - Matt Wolfe
- Session 6 - Sean Cannell
- Session 7 - Strings FX + Andrew Davis

**** Drive 5
- Session 2 - Michael Stelzner
- Session 3 Mindy Weinstein
- Session 4 Joe Pullizi
- Session 5 Matt Wolfe
- Session 6 Sean Cannell
- Session 7 Strings FX + Andrew Davis
-

  Stage right andrew davis and mari smith

** SEAS Quarterly checkin                                         :REMINDER:
 <2024-05-28 Tue 13:49> 
 [2024-05-01 Wed 13:49]
 [[file:~/Orgfiles/configbackups/main-config.org::*default frame settings][default frame settings]]

** Buffini Visit                                                  :REMINDER:
 <2024-07-11 Thu 13:00>--<2024-07-11 Thu 15:00> 
 [2024-07-11 Thu 12:33]

** Cutwater Demo                                                  :REMINDER:
 <2024-09-19 Thu 12:30-13:30> 
 [2024-09-19 Thu 11:37]

** Blog Release                                                   :REMINDER:
 <2024-09-25 Wed> 
 [2024-09-19 Thu 11:49]

** Podcast Release                                                :REMINDER:
 <2024-09-19 Thu> 
 [2024-09-19 Thu 11:50]

** Podcast Release                                                :REMINDER:
 <2024-10-03 Thu> 
 [2024-09-19 Thu 11:51]

** Meet Josh For Lunch                                            :REMINDER:
 <2024-12-14 Sat 13:00> 
 [2024-12-13 Fri 17:45]


* Meetings
:PROPERTIES:
:CATEGORY: Meeting
:END:

** Exact same thing for 2025
** Next Steps
** Waffle Party                                                   :REMINDER:
:PROPERTIES:
:Effort:   1:00
:END:
 <2024-04-25 Thu 12:00> 
 [2024-04-25 Thu 11:16]

** 401k Event                                                     :REMINDER:
:PROPERTIES:
:Effort:   1:00
:END:
 <2024-04-25 Thu 13:00> 
 [2024-04-25 Thu 11:17]

** Meetings Notes                                                     :NOTE:
- 
** Next Steps

** Meet with David re sound design                                :REMINDER:
 <2024-08-02 Fri 13:00> 
 [2024-08-02 Fri 10:51]

** Next Steps
** MEETING re: Website                                             :MEETING:
[2024-10-25 Fri 10:56]
*** Attendees
- Doron
- Zack
*** Meetings Notes & Questions                                         :NOTE:
- For Doron
  - Can I update the "team" section i.e. add/remove people? Anything to be aware of in the process?
  - SEO plugin currently on site?
  - 
- For Zack
  - Where on the team page should we put Jeremy?
  - We ok to remove Erica from this page?
*** Next Steps
**** TODO Get Jeremy's Fun Fact & Bio
SCHEDULED: <2024-12-10 Tue 12:30>
:PROPERTIES:
:CATEGORY: Task
:END:
**** DONE Ask Troy if need to update Jeremy's headshot 
CLOSED: [2024-11-26 Tue 13:15]
**** TODO update webiste with newer more corporate photos
** MEETING re: Managers Meeting                                    :MEETING:
:LOGBOOK:
CLOCK: [2024-12-06 Fri 09:06]--[2024-12-06 Fri 09:39] =>  0:33
:END:
[2024-12-06 Fri 09:06]
*** Attendees
- 
*** Meetings Notes                                                     :NOTE:
- What are you and your dept working on
- Need help with anything?
- Concerns
  
- working on

  - events in Q1
  
*** Next Steps
** MEETING re: marketing meeting                                   :MEETING:
:LOGBOOK:
CLOCK: [2024-12-13 Fri 17:43]--[2024-12-13 Fri 17:44] =>  0:01
:END:
[2024-12-13 Fri 17:43]
*** Attendees
- Josh
- Troy
- Zack
q*** Meetings Notes                                                     :NOTE:
- This note just got made regarding NI connect
*** Next Steps
**** TODO Create a marketing calendar 
* Event
:PROPERTIES:
:CATEGORY: Event
:END:

** Marketing 2024 Yearly Planning                                 :REMINDER:

 <2023-12-06 Wed 14:00> 
 [2023-12-01 Fri 13:56]

** Meet with Tom and Zack                                         :REMINDER:
:PROPERTIES:
:CATEGORY: Meeting
:END:
 <2024-03-13 Wed 09:00> 
 [2024-03-11 Mon 14:38]

** Podcast Recording Session                                      :REMINDER:
 [2024-03-13 Wed 09:56]


** Meet with Carolyn & Kirin                                      :REMINDER:
 <2024-03-21 Thu 01:30> 
 [2024-03-19 Tue 13:19]

** Meet re digital Billboard Advertizing                          :REMINDER:
:PROPERTIES:
:CATEGORY: Meeting
:Effort:   0:30
:END:
 <2024-04-02 Tue 11:00> 
 [2024-04-01 Mon 13:40]

** Meet with Tom Stimson and Zack re: Website Structure           :REMINDER:
:PROPERTIES:
:CATEGORY: Meeting
:END:
 <2024-04-03 Wed 12:30> 
 [2024-04-01 Mon 13:52]

** Drip Campaign Review                                           :REMINDER:
 <2024-04-04 Thu 09:00> 
 [2024-04-03 Wed 14:18]

** Meet with Lasso re: Proposal                                   :REMINDER:
:PROPERTIES:
:CATEGORY: Meeting
:END:
 <2024-04-03 Wed 15:30> 
 [2024-04-03 Wed 14:30]

** SEAS Thanksgiving                                              :REMINDER:
 <2024-11-25 Wed 12:30> 
 [2024-10-29 Tue 12:25]

** SEAS Holiday Party <Tenative>                                  :REMINDER:
 <2024-12-20 Fri 12:31> 
 [2024-10-29 Tue 12:31]

* Recurring                                                       :RECURRING:
:PROPERTIES:
:CATEGORY: Recurring
:END:
** Weekly Marketing Meeting  13:00-14:00
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-19 Wed 11:20
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Reminders
:ARCHIVE_CATEGORY: Reminder
:ARCHIVE_ITAGS: SEAS Reminder
:CATEGORY: Meeting
:END:

  <%%(memq(calendar-day-of-week date) '(3))>
:PROPERTIES:
:Effort:   1:00
:END:

** Weekly Catch Up 13:00-14:00
:PROPERTIES:
:CATEGORY: Meeting
:END:

 [2023-07-31 Mon 10:50]
 <%%(memq (calendar-day-of-week date) '(1))>  
* Phone Calls
:PROPERTIES:
:CATEGORY: phone
:END:

